import React, {createContext, useEffect, useState} from 'react';
type ContextType = {
    randomText: string;
    generateRandomText:()=> void
}
const RandomTextContext = createContext<ContextType>({
    randomText: '',
    generateRandomText: () => null,
});


const RandomTextProvider: React.FC<{ children: React.ReactNode }> = ({ children }) => {
    const textOptions = [
        "Оны да ермек қыла алмадым. Ақыры ойладым: осы ойыма келген нәрселерді қағазға жаза берейін, ақ қағаз бен қара сияны ермек қылайын, кімде-кім ішінен керекті сөз тапса, жазып алсын, я оқысын, керегі жоқ десе, өз сөзім өзіңдікі дедім де, ақыры осыған байладым, енді мұнан басқа ешбір жұмысым жоқ.",
        "Ал, енді қалған өмірімізді қайтіп, не қылып өткіземіз? Соны таба алмай өзім де қайранмын. Ел бағу? Жоқ, елге бағым жоқ. Бағусыз дертке ұшырайын деген кісі бақпаса, не албыртқан, көңілі басылмаған жастар бағамын демесе, бізді құдай сақтасын! ",
        "Бұл жасқа келгенше жақсы өткіздік пе, жаман өткіздік пе, әйтеуір бірталай өмірімізді өткіздік: алыстық, жұлыстық, айтыстық, тартыстық - әурешілікті көре-көре келдік.",
        "Енді жер ортасы жасқа келдік: қажыдық, жалықтық; қылып жүрген ісіміздің баянсызын, байлаусызын көрдік, бәрі қоршылық екенін білдік. Мал бағу? Жоқ, баға алмаймын. Балалар өздеріне керегінше өздері бағар.",
        "Ғылым бағу? Жоқ, ғылым бағарға да ғылым сөзін сөйлесер адам жоқ. Білгеніңді кімге үйретерсің, білмегеніңді кімнен сұрарсың? Елсіз-күнсізде кездемені жайып салып, қолына кезін алып отырғанның не пайдасы бар? ",
        "Енді қартайғанда қызығын өзің түгел көре алмайтұғын, ұры, залым, тілемсектердің азығын бағып беремін деп, қалған аз ғана өмірімді қор қылар жайым жоқ.",
        "Мұңдасып шер тарқатысар кісі болмаған соң, ғылым өзі - бір тез қартайтатұғын күйік. Софылық қылып, дін бағу? Жоқ, ол да болмайды, оған да тыныштық керек. Не көңілде, не көрген күніңде бір тыныштық жоқ, осы елге, осы жерде не қылған софылық?",
        "Балаларды бағу? Жоқ, баға алмаймын. Бағар едім, қалайша бағудың мәнісін де білмеймін, не болсын деп бағам, қай елге қосайын, қай харекетке қосайын? Балаларымның өзіне ілгері өмірінің, білімінің пайдасын тыныштықпенен керерлік орын тапқаным жоқ, қайда бар, не қыл дерімді біле алмай отырмын, не бол деп бағам?"
    ];


    const [randomText, setRandomText] = useState('');

    const generateRandomText = () => {
        const randomIndex = Math.floor(Math.random() * textOptions.length);
        setRandomText(textOptions[randomIndex]);
    };

    useEffect(() => {
        generateRandomText();
    }, []);


    return (
        <RandomTextContext.Provider value={{ randomText , generateRandomText }}>
            {children}
        </RandomTextContext.Provider>
    );
};

export { RandomTextProvider, RandomTextContext };
